In [19]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "department": ["IT", "IT", "HR", "HR","MR","MR"],
    "age": [25, np.nan, 30, 22, 34,34],
    "salary": [50000, 60000, np.nan, 45000,2000,2000]
})
df

  department   age   salary
0         IT  25.0  50000.0
1         IT   NaN  60000.0
2         HR  30.0      NaN
3         HR  22.0  45000.0
4         MR  34.0   2000.0
5         MR  34.0   2000.0

In [20]:
# Drop rows with missing values
df_drop = df.dropna()
df_drop

  department   age   salary
0         IT  25.0  50000.0
3         HR  22.0  45000.0
4         MR  34.0   2000.0
5         MR  34.0   2000.0

In [21]:
df["age"] = df["age"].fillna(df["age"].mean())
df

  department   age   salary
0         IT  25.0  50000.0
1         IT  29.0  60000.0
2         HR  30.0      NaN
3         HR  22.0  45000.0
4         MR  34.0   2000.0
5         MR  34.0   2000.0

In [22]:
df['salary'].fillna(df['salary'].mean(),inplace=True)
df

  department   age   salary
0         IT  25.0  50000.0
1         IT  29.0  60000.0
2         HR  30.0  31800.0
3         HR  22.0  45000.0
4         MR  34.0   2000.0
5         MR  34.0   2000.0

In [23]:
df[df.duplicated() == False]

  department   age   salary
0         IT  25.0  50000.0
1         IT  29.0  60000.0
2         HR  30.0  31800.0
3         HR  22.0  45000.0
4         MR  34.0   2000.0

In [27]:
df.groupby('department')['salary'].sum()

department
HR     76800.0
IT    110000.0
MR      4000.0
Name: salary, dtype: float64

In [32]:
df['salary'] = df['salary']*2
df

  department   age    salary
0         IT  25.0  200000.0
1         IT  29.0  240000.0
2         HR  30.0  127200.0
3         HR  22.0  180000.0
4         MR  34.0    8000.0
5         MR  34.0    8000.0

In [34]:
df['runnuing_total'] = df['salary'].cumsum()
df

  department   age    salary  runnuing_total
0         IT  25.0  200000.0        200000.0
1         IT  29.0  240000.0        440000.0
2         HR  30.0  127200.0        567200.0
3         HR  22.0  180000.0        747200.0
4         MR  34.0    8000.0        755200.0
5         MR  34.0    8000.0        763200.0